import numpy as np

"""Ознобихин Михаил 426 гр
y'+ (2y+1)*ctg(x)=0 - исходное ур-ие
y = 1/(2*C0 * sin(x)**2) - 1/2 - после преобразований
"""

C0 = 2001+11**3 # константа интегрирования

f = lambda x: 1 / (C0*2*(np.sin(x)**2))-1/2  # Сама функция

a = 0 # Начальные точки
b = 100

e = 1.0e-12 # Погешность

c = (a+b)/2
while abs(f(c)) > e:
    if f(a)*f(c) < 0:
        b = c # Сдвигаем правую границу
    if f(b)*f(c) < 0:
        a = c # Сдвигаем левую границу
    c = (a+b)/2

print("x =",c , ", y = ",f(c))